{
  "_class_name": "UNet2DConditionModel",
  "_diffusers_version": "0.20.0",
  "act_fn": "silu",
  "attention_head_dim": 8,
  "block_out_channels": [320, 640, 1280, 1280],
  "center_input_sample": false,
  "cross_attention_dim": 768,
  "down_block_types": [
    "CrossAttnDownBlock2D",
    "CrossAttnDownBlock2D",
    "CrossAttnDownBlock2D",
    "DownBlock2D"
  ],
  "up_block_types": [
    "UpBlock2D",
    "CrossAttnUpBlock2D",
    "CrossAttnUpBlock2D",
    "CrossAttnUpBlock2D"
  ],
  "in_channels": 4,
  "out_channels": 4,
  "layers_per_block": 2,
  "norm_eps": 1e-5,
  "norm_num_groups": 32,
  "sample_size": 64
}
